2889. Reshape Data: Pivot

DataFrame weather
+-------------+--------+
| Column Name | Type   |
+-------------+--------+
| city        | object |
| month       | object |
| temperature | int    |
+-------------+--------+
Write a solution to pivot the data so that each row represents temperatures for a specific month, and each city is a separate column.

The result format is in the following example.

 

Example 1:
Input:
+--------------+----------+-------------+
| city         | month    | temperature |
+--------------+----------+-------------+
| Jacksonville | January  | 13          |
| Jacksonville | February | 23          |
| Jacksonville | March    | 38          |
| Jacksonville | April    | 5           |
| Jacksonville | May      | 34          |
| ElPaso       | January  | 20          |
| ElPaso       | February | 6           |
| ElPaso       | March    | 26          |
| ElPaso       | April    | 2           |
| ElPaso       | May      | 43          |
+--------------+----------+-------------+
Output:
+----------+--------+--------------+
| month    | ElPaso | Jacksonville |
+----------+--------+--------------+
| April    | 2      | 5            |
| February | 6      | 23           |
| January  | 20     | 13           |
| March    | 26     | 38           |
| May      | 43     | 34           |
+----------+--------+--------------+
Explanation:
The table is pivoted, each column represents a city, and each row represents a specific month.

In [2]:
import pandas as pd

In [3]:
data = {"city":["Jacksonville","Jacksonville","Jacksonville","Jacksonville","Jacksonville","ElPaso","ElPaso","ElPaso","ElPaso","ElPaso"],
       "month":["January","February","March","April","May","January","February","March","April","May"],
       "temperature":[13,23,38,5,34,20,6,26,2,43] }

In [5]:
weather = pd.DataFrame(data)

weather

           city     month  temperature
0  Jacksonville   January           13
1  Jacksonville  February           23
2  Jacksonville     March           38
3  Jacksonville     April            5
4  Jacksonville       May           34
5        ElPaso   January           20
6        ElPaso  February            6
7        ElPaso     March           26
8        ElPaso     April            2
9        ElPaso       May           43

In [29]:
output = weather.pivot( columns=["city"],index ="month" ,values= "temperature" )

In [30]:
output.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, April to May
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ElPaso        5 non-null      int64
 1   Jacksonville  5 non-null      int64
dtypes: int64(2)
memory usage: 120.0+ bytes

In [31]:
output

city      ElPaso  Jacksonville
month
April          2             5
February       6            23
January       20            13
March         26            38
May           43            34